---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidContextForAdaptivePlacement
source: html/5195919e-ef7e-11f8-d726-ba187164bfa9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidContextForAdaptivePlacement Property

The component '%1!s!' cannot be directly placed in the project environment. Place it in either an In-Place Mass, a Conceptual Mass Family, a Curtain Panel by Pattern Family, or an Adaptive Component.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidContextForAdaptivePlacement { get; }
```